<template>
  <div class="container mx-auto p-8">
    <h1 class="text-xl font-bold mb-8">{{ title }}</h1>
    <div>
      <pre class="whitespace-pre-wrap text-base text-gray-700 bg-white p-4">
1、本政策仅适用于中国大陆发布的扣叮兔AI助手应用用户。
2、本政策仅适用于扣叮兔AI助手应用相关产品和服务。
 
																						  			  	 版本发布日期：2023年11月19日																								生效日期：2023年12月20日

“扣叮兔AI助手”软件深圳市扣叮兔科技有限公司研发的免费在线英语学习软件，旨在以更加灵活的方式帮助用户提升英语口语能力。本《扣叮兔AI助手使用协议》由用户和深圳市扣叮兔科技有限公司（以下简称“扣叮兔AI助手”）共同缔结，对双方具有法律约束力。
本协议内容包括协议正文及所有扣叮兔AI助手已经发布的或将来可能发布的各类规则、说明或其他文件。所有上述文件视为本协议不可分割的一部分，与本协议正文具有同等法律效力。用户应具有完全民事行为能力和民事权利能力，否则应在监护人的指导下进行注册、使用。任何用户在使用扣叮兔AI助手之前，务必认真阅读本协议的全部内容，特别是加粗部分。如遇任何疑问应向相关专业人士或扣叮兔AI助手客服咨询。如用户接受本协议，用户应严格遵守本协议及相关规则的约束。
扣叮兔AI助手可能根据实际业务需要对已发布的各类规则、协议、说明或其他文件进行不定时的修订。如确有修订，扣叮兔AI助手将通过包括但不限于：在扣叮兔网站上进行刊载、向用户注册时提交的手机号及其他联系方式发送通知等（对于任何非经扣叮兔AI助手正规渠道获得的任何信息，扣叮兔AI助手不承担由此造成的法律责任）如用户不同意相关修订，应立即停止使用扣叮兔AI助手提供的任何服务。经修订的协议一经在扣叮兔网站，立即自动生效并成为本协议的一部分。如用户登录或继续使用扣叮兔AI助手提供的任何服务，则视为用户完全同意该等修订。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本协议约束。
请用户注意：一旦用户点击“我已阅读并同意《扣叮兔AI助手使用协议》”并按照扣叮兔AI助手注册程序成功注册为正式用户（下称“注册用户”）或者实际使用扣叮兔AI助手提供的相关服务，即表示用户已理解并完全接受本协议缔约的所有条件及全部内容，同意受本协议约束。届时用户无权以未阅读本协议的内容等理由，主张本协议无效，或要求撤销本协议。 

一、服务内容
1.1 本应用提供智能对话和智能英语口语练习服务。通过使用本应用的口语练习功能，用户可以进行针对性英语口语训练。
1.2 用户也可通过UGC方式自行上传视频至扣叮兔AI助手。待扣叮兔AI助手审核通过后，方可供其他用户进行使用及分享。
1.3 上述服务或免费或需付费，如需付费，扣叮兔AI助手会明确向用户明确作出提示。只有用户根据提示确认其愿意且进行了相关费用的支付，用户才能使用该等付费服务。如用户拒绝支付相关费用，则扣叮兔AI助手有权不向用户提供该等收费服务。扣叮兔AI助手会根据实际情况对所提供的服务及费用进行调整。
1.4 用户知悉并理解：用户为使用扣叮兔AI助手而产生的包括但不限于使用网络接入、手机通信、电脑及其他相关设备等产生的费用由用户自行承担。
1.5 用户理解并同意：扣叮兔AI助手仅出于教学及为用户学习英语之目的而提供上述服务，用户不得利用该等服务从事任何违反现有国家法律、法规、规章及政策的规定；否则，扣叮兔AI助手有权终止向用户提供本协议所涉的所有服务，向国家相关机关进行举报，及要求用户承担全部损失。

二、使用规则
2.1 用户在使用扣叮兔AI助手提供的服务时，必须遵守中华人民共和国相关法律法规的规定及扣叮兔AI助手制定的各类规则,且不得利用扣叮兔AI助手提供的服务进行任何违法或不正当的活动，包括但不限于下列行为∶
2.1.1上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：
a.反对宪法所确定的基本原则的；
b.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
c.损害国家荣誉和利益的；
d.煽动民族仇恨、民族歧视、破坏民族团结的；
e.破坏国家宗教政策，宣扬邪教和封建迷信的；
f.散布谣言，扰乱社会秩序，破坏社会稳定的；
g.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
h.侮辱或者诽谤他人，侵害他人合法权利的；
i.含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
j.含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
2.1.2不得从事以下行为之一：
a.将用户获取的部分或全部服务出售、转让、出界给其他第三方；
b.危害扣叮兔AI助手的公司名誉、形象、知识产权、商标权等合法权利的；
c.妨碍扣叮兔AI助手正常的业务经营活动，侵害扣叮兔AI助手的商业利益；
d.未经扣叮兔AI助手允许，在扣叮兔AI助手上发送任何商业信息或向其他用户发送包括任何商业广告、骚扰信息、言论及其他扣叮兔AI助手认为不当的消息；
e.妨碍其他用户正常合法使用扣叮兔AI助手服务的活动；
f.对扣叮兔AI助手任何工作人员及其他用户进行言论攻击或其他不当行为；
g.利用注册之便利窃取扣叮兔AI助手的商业机密；
h.违反犯罪行为；
i.其它扣叮兔AI助手判断为不适当的行为；
2.1.3所有用户承诺：
a.未经允许，不得对扣叮兔AI助手网络教育平台中存储、处理或者传输的数据和应用程序进行删除、修改或者增加；
b.未经允许，不得故意制作、传播计算机病毒等破坏性程序的；
c.所有向扣叮兔AI助手提交的信息材料真实、有效，不存在虚假或隐瞒成分；
d.其他危害计算机信息网络安全的行为；
2.2用户如需购买扣叮兔AI助手提供的付费服务，需要按照扣叮兔AI助手的提示及合作的支付机构要求进行，并在确保周边支付网络环境安全进行操作。由用户自身操作不当、有误等原因造成的损失，扣叮兔AI助手不承担赔偿责任。如由于扣叮兔AI助手系统出现重大故障致用户支付失败，用户应立即联系扣叮兔AI助手，并保存该等故障致损或可能致损的证据，扣叮兔AI助手将根据用户提供的信息采取措施。
特别提醒：如遇要求用户支付款项的短信、电话、邮件或其他通知，请用户务必联系扣叮兔AI助手的工作人员进行确认，以免造成不必要的损失。
2.3扣叮兔AI助手提供的服务如存在有效期的，用户应在有效期内使用。如用户未在有效期内使用的，则视为扣叮兔AI助手已完全履行该服务义务，且无需退还用户已支付的任何费用（如有）。

三、用户权利与义务
3.1 为更好地使用扣叮兔AI助手的全部功能，用户应依照提示完成全部注册程序。用户注册时，应提交真实的材料信息。扣叮兔AI助手有权对该等信息进行审核，但扣叮兔AI助手无须对该等信息的正确性、完整性、有效性或由此造成的任何损失承担任何责任。
3.2 用户个人的注册信息发生变化时，应及时更新自己的注册信息，保证其个人资料的详尽和准确。
3.3 用户完成注册之后，可使用该账号进行登录并使用扣叮兔AI助手的相关服务。用户应妥善保管该账号及密码，绝不对任何第三方泄露用户账户信息。用户应妥善保管自己的扣叮兔AI助手账户，一切由该账户进行的操作皆视为用户本行为，用户应对该账户进行的操作承担全部责任。
3.4 如用户发现自己的账户信息泄密应立即联络扣叮兔AI助手客服人员，以便扣叮兔AI助手采取相应措施。
3.5 用户有权按照扣叮兔AI助手的相关规则享受扣叮兔AI助手提供的各项服务。

四、用户隐私
扣叮兔AI助手十分重视用户的个人隐私并将按照如下规则合法保护用户的隐私。
4.1 适用范围：
4.1.1用户使用在扣叮兔AI助手服务或产品，或访问扣叮兔AI助手网页时，扣叮兔AI助手自动接收并记录的用户浏览器上的服务器数值，包括但不限于IP地址等数据及用户要求取用的网页记录；
4.1.2扣叮兔AI助手收集到的用户在使用扣叮兔AI助手的有关数据，包括但不限于问题咨询、服务购买等行为；
4.1.3 扣叮兔AI助手通过合法途径从商业伙伴处取得的用户个人数据；
4.2 使用规则：
4.2.1 用户提交的个人信息仅限于扣叮兔AI助手为用户提供服务之目的，包括但不限于向用户发出产品或服务的相关信息，或与扣叮兔AI助手合作方共享用户的信息，以便扣叮兔AI助手或合作方向用户发送有关产品或服务的信息；
4.2.2 扣叮兔AI助手承诺不会向任何人出售、出租、出借或无偿提供用户的个人信息，除非事先得到用户的许可；
4.2.3 扣叮兔AI助手亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息。如有用户如从事上述活动，一经发现，扣叮兔AI助手有权立即终止与该用户的用户协议，查封其账号；
4.2.4 扣叮兔AI助手将竭力保障用户的隐私信息安全，但用户知悉并同意如因黑客攻击或其他非因扣叮兔AI助手原因导致用户的信息泄露，扣叮兔AI助手对此不承担任何责任，但扣叮兔AI助手仍将采取相关措施尽量减少给用户造成的损失；
4.2.5 用户知悉并同意扣叮兔AI助手将包括但不限于邮件、短信等形式向用户发送有关扣叮兔AI助手的服务和产品信息的商业广告，以便向用户提供更好的服务；如用户不需要该等广告信息，应明确向扣叮兔AI助手提出。
4.3 在如下情况下，扣叮兔AI助手可能会披露用户的信息：
4.3.1经用户事先同意，向第三方披露；
4.3.2为提供用户所要求的产品或服务，而必须和第三方分享用户的个人信息；
4.3.3根据法律、法规、法律程序的要求或政府主管部门的强制性要求；
4.4 cookie的使用。cookie主要的功能是便于用户使用网站产品和/或服务，以及帮助网站统计独立访客数量等。运用cookie技术，扣叮兔AI助手能够为用户提供更加周到的个性化服务，并允许用户设定用户特定的服务选项。用户理解并不可撤销的同意扣叮兔AI助手会在用户的计算机上设定或取用扣叮兔AI助手 cookies。当然，用户可以通过修改浏览器相关设置来拒绝使用cookies，但如用户选择拒绝使用cookie，则可能影响用户使用扣叮兔AI助手提供服务的便利性。扣叮兔AI助手通过所设cookie取得的有关信息，也将按照本协议规则执行。

五、知识产权
5.21扣叮兔AI助手呼吁用户尊重知识产权，希望用户能以学习英语为目的，合法、合理地使用扣叮兔AI助手软件及软件中所涉视频，支持、尊重权利人的版权。未经权利人同意，用户不得下载、复制、改编、修改、传播或以其他方式不当使用受版权保护的内容。也请勿滥用或干扰扣叮兔AI助手提供的教学服务，包括但不限于将扣叮兔AI助手的产品、服务用于侵犯版权的非法目的，删除扣叮兔AI助手产品中的权利人信息、篡改相关计算机代码、攻击扣叮兔AI助手服务等。
5.3 扣叮兔AI助手明确地表示拒绝对于服务、资料或产品给予任何明示或默示的之保证，包括但不限于，为商业使用或适合于特定目的保证。扣叮兔AI助手对于因服务，资料或产品所生之任何直接、间接、附带的或因此而导致之衍生性损失概不负责。
5.4 扣叮兔AI助手在适当情况下，可自行决定终止侵害或违反他人权利之使用者的账号。如果用户对他人的知识产权造成了侵害，扣叮兔AI助手将依国家法律法规的规定，或在适当的情形下，将依其服务条款或其相关规范性规定，删除特定内容或以至终止用户对账户的使用。
5.5 因扣叮兔AI助手向用户提供服务或产品而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。
5.6 对于用户在扣叮兔AI助手上发表的可公开获取的任何内容（包括但不限于言论、视频、音频等），用户同意并授权扣叮兔AI助手在全世界范围内具有免费的、永久的、不可撤销的、非独家的和完全再许可的权利和许可，以使用复制、修改、改编、出版、翻译、据以创作衍生作品、传播、加注扣叮兔AI助手的水印、表演和展示此等内容（整体或部分），和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。
5.7 若用户认为扣叮兔AI助手所载内容或其他用户所发的任何信息侵犯其合法权益的，其可根据相关法律规定、扣叮兔AI助手的规则，及时与扣叮兔AI助手联系并提供详实的举证材。经核实后，扣叮兔AI助手将按照法律规定及扣叮兔AI助手相关规则采取相应措施。用户理解并同意：扣叮兔AI助手仅为中立的网络服务平台，当出现上述非因扣叮兔AI助手原因发生的侵权事件，扣叮兔AI助手仅在法律规定范围内协助用户进行维权，不承担用户遭受的任何损失。

六、服务终止
如发生下列任何一种情形，扣叮兔AI助手有权随时中断或终止向用户提供本协议项下的服务而无需对用户或任何第三方承担任何责任，且用户应赔偿给扣叮兔AI助手造成的全部损失：
1. 用户违反本协议任一规定；
2. 用户未按照服务要求支付服务费用；
3. 用户对扣叮兔AI助手更新的协议内容或其他相关责任明示不愿意接受的；
4. 因不可抗力，导致本协议不能继续履行的；
5. 用户未在所购买服务约定的期限内使用该服务的；
用户同意：扣叮兔AI助手根据本协议约定终止本服务后，有权将用户在扣叮兔AI助手上的账号及相关信息及其他内容加以移除并删除，或禁止继续使用本服务。如涉及费用退还的，按照扣叮兔AI助手已公示的规则执行。

七、免责条款
7.1 用户知悉并同意，因下述任一情况而导致的任何损害赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (而无论扣叮兔AI助手是否已被告知该等损害赔偿的可能性) 扣叮兔AI助手不予承担：
7.1.1因用户自身原因而导致账户及密码泄露、被盗而发生的任何损失；
7.1.2由于不可抗力、黑客攻击及其他非因扣叮兔AI助手的原因使本站系统崩溃或无法正常使用导致扣叮兔AI助手向用户提供的服务或产品被迫中断或停止等；
7.1.3无论扣叮兔AI助手是否通知，扣叮兔AI助手于任何时间暂时或永久修改或更新本服务（或其任何部分），因该等修改、更新或暂停而给用户或任何第三人造成的损失；
7.1.4 其他非因扣叮兔AI助手导致的损失；
7.2 用户知悉并同意：扣叮兔AI助手不保证所提供的服务或产品一定能够满足用户的要求。且基于互联网的特殊性，扣叮兔AI助手也不保证该服务或产品不会因各种客观原因中断，对服务的及时性、安全性、出错发生均不作保证，用户应提前做好相应的准备事项，并自行承担系统受损或资料丢失的风险和责任。
7.3 用户理解并同意，如因扣叮兔AI助手过错导致用户不能享受相应服务，扣叮兔AI助手仅在用户实际支付的全部费用范围予以赔偿。

八、其它条款
8.1 本协议的订立、执行、解释和争议的解决均适用现行中华人民共和国法律法规。
8.2 如发生本协议部分条款与中华人民共和国法律法规相抵触时，不影响其他条款的效力，扣叮兔AI助手和用户仍应按照其他条款的约定履行相应的义务。
8.3 如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方应向杭州市滨江区人民法院提起诉讼。
      </pre>
    </div>
    <!-- <div class="mt-10 sm:mx-auto sm:w-full sm:max-w-sm">
      <button @click="goBack"
        class="mt-10 flex w-full justify-center rounded-md bg-blue px-3 py-1.5 text-sm mt-2d leading-6 text-white shadow-sm hover:bg-blue-500 focus-visible:outline focus-visible:outline-2 focus-visible:outline-offset-2 focus-visible:outline-indigo-600">
        返回
      </button>
    </div> -->
  </div>
</template>

<script lang="ts">
import terms from '@/assast/terms.json'
import { ref } from 'vue'

export default {
  name: 'TermsOfUse',
  setup() {
    const goBack = () => {
      history.back();
    }
    return {
      title: '《使用协议》',
      goBack
    }
  }
}
</script>