<template>
  <div class="container mx-auto p-8">
    <h1 class="text-xl font-bold mb-8">{{ title }}</h1>
    <div>
      <pre class="whitespace-pre-wrap text-base text-gray-700 bg-white p-4">
1、本政策仅适用于中国大陆发布的扣叮兔AI助手应用用户。
2、本政策仅适用于扣叮兔AI助手应用相关产品和服务。
 
版本发布日期：2023年11月19日
生效日期：2023年12月20日
 
您的个人信息安全对我们来说至关重要。一直以来，扣叮兔科技都致力于为每位用户提供更安全的互联网环境。我们将依据《中华人民共和国网络安全法》《信息安全技术 个人信息安全规范》（GB/T 35273-2020）以及其他相关法律法规和技术规范收集和使用您的个人信息，以帮助我们向您提供更优质的产品和/或服务。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则。《扣叮兔AI助手隐私保护指引》（以下简称“本指引”）将以更透明的方式呈现我们收集和使用您个人信息的情况，以及您享有的对个人信息的控制权。我们承诺会对您的个人信息和其他数据进行严格保密，并严格按照本指引所阐述的内容处理您的个人信息。我们会根据您的同意和其他可处理您个人信息的法律依据收集、使用、存储、共享和转移您的个人信息。
 
以下是本指引的要点说明：
1.为帮助您注册并使用我司产品或服务，我们可能收集与提供服务相关的个人信息，您有权拒绝或撤回授权；
2.您可以访问、更正、删除您的个人信息。改变您授权同意的范围，注销您的账户，我们为您提供了行使这些权利的途径。
3.我们采取了互联网业内标准的技术措施和数据安全措施来保护您的个人信息安全。
4.除非再次征得您的同意，我们不会将您的个人信息用于本指引未载明的其他目的。
5.当您对本指引有任何疑问，可以和我们进一步联系和咨询。

 
为了更好保护您的个人信息，请在使用我们的产品或服务前，建议您仔细、完整阅读并了解本指引。
目录
1.引言
2.我们处理个人信息的法律依据
3.我们如何收集和使用您的个人信息
4.我们如何共享、转让、公开披露您的个人信息
5.我们如何保护您的个人信息
6.您管理个人信息的权利
7.个性化推荐
8.我们发出的通知
9.我们如何使用Cookie等同类技术
10.您个人信息的存储
11.我们如何处理未成年人的个人信息
12.如何更新本指引
13.如何联系我们
14.争议解决
15.名词解释
 
1.引言
本指引只用于提供扣叮兔AI助手App产品和服务的深圳市扣叮兔科技有限公司及其关联公司（以下简称“我们”）
【特别提示】
请您在使用我们的各项产品和/或服务前，仔细阅读并充分理解本指引。重点内容我们已采用粗体表示，希望您特别关注。一旦您使用或继续使用菲助科技产品/服务，即表示您同意我们按照本指引处理您的相关信息。如对本指引有任何疑问，您都可以通过本指引中“如何联系我们”一节提供的联系方式与我们联系。
为了便于您理解本指引的相关概念，我们对专有名字标记了下划线并在本指引第11节“名词解释”中给予详细介绍。本指引中相关名词的右上角用“*”标记的，代表涉及扣叮兔科技收集的敏感信息，我们向您加以增强式提示。
我们可能会不时对本指引进行修订。当本指引发生变更时，我们会在版本更新后以通知、弹窗形式向您展示变更后的内容。
请您注意，只有在您确认同意变更后，我们才会按照更新后的《扣叮兔AI助手隐私保护指引》收集、使用、处理和存储您的个人信息；您可以选择不同意，但这可能导致您无法完整使用扣叮兔AI助手App的产品和服务。
 
2.扣叮兔AI助手处理个人信息的法律依据
如果您是中华人民共和国大陆地区的用户，我们将依据《中华人民共和国网络安全法》《信息安全技术个人信息安全规范》（GB/T 35273-2020）以及其他相关法律法规收集和使用您的个人信息，为您提供扣叮兔AI助手App的产品和服务。我们通常只会在征得您同意的情况下收集您的个人信息。在某些情况下，我们还可能基于法律义务或者履行合同之必需向您收集个人信息，或者可能需要个人信息来保护您的重要利益或其他人的重要利益。
 
3.我们如何收集和使用您的个人信息
我们会遵循正当、合法、必要的原则，出于本指引所述的以下目的，收集和使用您在服务过程中主动提供或因使用菲助科技产品和/或服务而产生的个人信息。如果我们要将您的个人信息用于本指引未载明的其它用途，或基于特定目的将收集而来的个人信息用于其他目的，我们将以合理的方式向您告知，并在使用前再次征得您的同意。
我们将通过以下途径获取您的个人信息：
 
3.1注册账号
3.1.1您注册并登录扣叮兔AI助手账户时，需要向我们提供以下信息：手机号码（用于实名认证）。提供上述信息并同意本指引后，您可以使用扣叮兔AI助手的核心业务功能，包括浏览App内的内容，发布信息，购买商品。如果您选择不提供为实现核心业务功能的必备信息或使用其中某类功能的必备信息，将导致我们无法为您提供该功能。
3.1.2.在您注册扣叮兔AI助手账号时，我们会推荐您提供手机号码进行实名认证，如您拒绝提供手机号码进行实名认证，将导致无法使用核心业务功能。
3.1.3我们可能从第三方间接获取您的个人信息
A.您使用第三方账户（微信）登录扣叮兔AI助手时，可选择授权扣叮兔AI助手在符合相关法律法规要求的前提下读取并获得您在该第三方平台上登记、公布、记录的公开信息（包括昵称、头像）。
B.扣叮兔AI助手需要您授权从第三方获取上述信息是为了记住您作为扣叮兔AI助手用户的登录身份，以向您提供更优质的产品和/或服务。我们仅会在您的授权同意的范围内收集并使用您的个人信息。在您使用第三方账户注册或登录后，您的第三方账户将会与扣叮兔AI助手账户进行绑定，您也可以选择关闭，取消账户绑定。
 
请注意，如您在扣叮兔AI助手服务中其他用户可见的公开区域内上传或发布的信息中，您对其他人上传或发布的信息作出回应中公开您的信息，该信息可能会被他人收集并加以使用。当您发现他人不正当地收集或使用您的信息时，可通过本政策“如何联系我们”所列举的反馈渠道与我们联系。
 
3.2向您提供产品和/或服务的核心业务功能
为实现扣叮兔AI助手的核心业务功能，我们可能需要向您收集个人信息。
 
您理解并同意，我们希望提供给您的产品和服务是完善的，所以我们会不断改进我们的产品和服务，这意味着随着产品服务的迭代、拓展、升级，我们可能会经常推出新的服务或业务功能或重新划分功能，并可能需要收集新的个人信息或变更个人信息使用的目的或方式。请您注意，如果我们要将您的个人信息用于本指引中未载明的其他用途或额外收集未提及的其他个人信息，我们会通过页面提示、交互流程、网站公告或其他方式另征得您的同意，一旦您同意，该额外用途将视为本指引的一部分，该额外的信息也将适用本指引。在此过程中，如您有任何疑问，您可通过“如何联系我们”所列举的反馈渠道与我们联系。
 
 
3.2.1录音/麦克风功能。
权限功能说明：使用麦克风录制音频
使用场景与目的：用于帮助您完成跟读相关功能。
 
3.2.2收集IMEI设备MAC地址。
使用功能说明：使用设备信息（唯一设备标识符（IMEI）、设备MAC地址）
使用的场景目的：进行身份验证、交易风险的判断安装列表。
 
3.2.3安装列表。
使用功能说明：作品可分享至微信小程序。
使用的场景目的：在分享前判断是否已经安装微信，未安装将提示先安装微信。分享到其他第三方应用如同。
 
3.2.4存储
使用功能说明：作品下载保存到本地
使用的场景目的：您需要下载配音作品时，我们将会申请访问您设备的存储权限。如您拒绝提供存储权限，将导致您不能下载配音作品到本地，但不影响使用最基本的功能。
 
3.2.5 获取粘贴板信息
使用功能说明：复制粘贴信息
使用的场景目的：您在第三方平台复制信息到扣叮兔AI助手或从扣叮兔AI助手复制信息粘贴到第三方平台时可使用剪切板功能。读取粘贴板匹配我们固定文本格式，解析后会弹窗提示是否跳转到指定页面。提升功能体验。如您关闭系统访问剪切板功能，只影响使用体验，但不影响使用基本功能。
 
 

3.3维护账号安全、保障服务正常运行、优化服务体验。
 
在您使用服务的过程中，为了识别账号异常状态、链接产品适配性、向您提供浏览、搜索等基本服务、保障服务的正常运行，优化服务体验，我们可能会直接或间接地收集、存储关于您使用功能的服务以及使用方式的信息并将这些信息进行关联，这些信息包括：
 
（a）日志权限：当您使用我们的服务时，我们可能会自动（包括在后台运行下）收集您对我们服务的详细使用情况，作为有关网络的日志保存，包括您的登录账号、搜索查询内容、IP地址、浏览器的类型、电信运营商、网络环境、使用的语言、访问日期和时间及您访问的网页浏览记录、push打开记录、停留时长、刷新记录、发布记录、关注、订阅、收藏及分享。
 
（b）设备权限：我们可能会根据您的软件安装及您明确授予的具体权限，接受并记录（包括在后台运行状态下接收记录）您所使用的设备相关信息：设备信息、操作系统及版本、客户端版本、设备分辨率、包名、设备设置、设备标识符（IMEI/AndroidID/OPENUDID/GUID/MAC OAID/IDFA/SIM卡IMSI信息）软硬件特征信息）、设备所在位置相关信息（IP地址）。为了收集上述个人设备信息，我们将会申请访问您的设备相关权限，包括设备信息权限、位置权限等。
 
请注意，单独的设备信息、日志信息是无法识别特定自然人身份信息的。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除非取得您的授权或法律法规另有规定外，我们会将该类个人信息作匿名化、去标识化处理。这些信息在结合使用期间，将作为您的个人信息按照本指引进行处理与保护。
 
3.4向您提供扣叮兔AI助手产品和/或服务的附加业务功能
为了向您提供更优质的产品和服务，我们可能需要收集下述信息。如果您拒绝提供下述信息，不影响您正常使用3.2项所描述的核心业务功能，但我们无法向您提供某些特定功能和服务。
3.4.1身份认证服务。
扣叮兔AI助手提供身份认证服务，当您在扣叮兔AI助手提供您的姓名、电话号码、职业、有关身份证明信息，以证实您的个人身份、从业资格（如教师资格证）核实您的教学资质。您申请认证为XX学校的老师，需要提供您的有关身份证明。在对您个人信息的真实性进行审核后，会为您标记认证标记，以及开通创建班级和加入对应机构相关服务。
3.4.2客户服务。
当您向扣叮兔AI助手提起投诉、申诉或者进行咨询时，为了方便与您联系或帮助您解决问题，我们可能需要您提供姓名、手机号码、电子邮件及其它联系方式的个人信息。如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。
3.4.4支付功能。
您可以在扣叮兔AI助手购买VIP会员、SVIP会员、部分商品。在您使用该功能的过程中可能会需要进行支付，在支付过程中，我们会通过您的第三方支付账号（如支付宝账号、Apple Pay账号和微信账号等信息）的SDK完成支付验证及付款。
3.4.5营销活动。
我们将会不时举办线上或线下的营销活动。在此类营销活动中，我们可能需要用户提供App注册信息*或收件信息，以便我们提供票务服务或寄送礼品。在涉及扣叮兔AI助手向您支付费用的情况下，我们可能需要收集您的相关信息用于代缴税款。
 
3.5敏感信息
在向扣叮兔AI助手提供任何属于敏感信息的个人信息前，请您清楚考虑该提供是恰当的并且同意您的个人敏感信息可按本指引所述的目的和方式进行处理。我们会在得到您的同意后收集和使用您的敏感信息以实现与扣叮兔AI助手业务相关的功能，并允许您对这些敏感信息的收集与使用作出不同意见的选择，但拒绝使用这些信息会影响您使用相关功能。
 
3.6征得授权同意的例外
根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：
（a）与国家安全、国防安全直接相关的；
（b）与公共安全、公共卫生、重大公共利益直接相关的；
（c）与犯罪侦查、起诉、审判和判决执行直接相关的；
（d）出于维护您或其他个人的生命、财产重大合法权益但又很难得到本人同意的；
（e）所收集的个人信息是您自行向社会公众公开的；
（f）从合法公开披露的信息中收集到您的个人信息，如从合法的新闻报道、政府信息公开渠道；
（g）根据您的要求签订和履行合同所必需的；
（h）用于维护扣叮兔AI助手的产品和/或服务的安全稳定运行所必需的，如发现、处置产品或服务的故障；
（i）法律法规规定的其他情形。
3.7如果您对我们收集和使用您的个人信息的法律依据有任何疑问或需要提供进一步的信息，请通过【如何联系我们】一节提供的联系方式与我们联系。
 
4. 我们如何共享、转让、公开披露您的个人信息
4.1共享您的个人信息
（一）委托处理
本业务功能中某些具体的板块或功能由外部供应商提供。我们会聘请服务提供商来协助我们提供客户支持。
 
扣叮兔AI助手可能接入或链接至第三方提供的社交媒体或其他服务（包括网站或其他服务形式）。包括：
 
（a）您可以利用“分享”键将扣叮兔AI助手中的某些内容（配音视频、作品、班级邀请）分享到第三方。或者您可利用第三方服务登录扣叮兔AI助手。这些功能可能会收集您的信息（包括您的日志信息）并可能在您的设备内置Cookies，从而正常运行上述功能；
（b）通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务网站；
（c）其他形式的第三方接入。
 
（二）共享
我们不会与本公司以外的任何公司、组织和个人共享您的个人信息，除非获得您的明确同意。目前，为实现本指引中声明的目的，我们接入的第三方服务或其他类似的应用程序（嵌入式代码、插件形式）以便提供更好的客户服务与客户体验。我们会在以下情形中，向您征求您对共享个人信息的授权同意。
目前，我们的授权合作伙伴包括以下几种类型： 
（a）用于广告、分析服务，包括展示、广告统计及监控；
（b）用于消息推送功能，包括手机厂商PUSH推送、特定时间提醒；
（c）用于支付相关服务，包括订单支付、交易行为核验、收入结算、支付信息汇总统计；
（d）用于在您同意的情况下获取的设备位置权限，收集设备信息和日志；
（e）用于第三方授权服务，包括第三方账号登入，将有关内容分享至第三方产品；
（f）用于支持产品功能，包括视频播放、智能客服、语音识别、内容存储、智能打分；
（g）用于优化产品性能，包括提高硬件配网能力，降低服务器成本，功能热修复；
（h）用于账号安全、产品加固相关服务，包括网络监测、域名解析。
 
 
第三方社交媒体、第三方支付或其他的第三方服务，由相关的第三方负责运营。您使用该第三方服务（包括您向该第三方提供的任何信息），须受第三方自己的服务条款及信息保护声明（而非本指引）约束，您需要仔细阅读其条款。本指引仅适用于我们所收集的个人信息，并不适用于任何第三方提供的服务或第三方的信息使用规则。如您发现这些第三方服务存在风险时，建议您终止相关操作以保护您的合法权益并及时与我们取得联系。
 
4.2转让
除非获取您的明确同意，我们不会将您的个人信息转让给任何公司、组织或个人。如果发生合并、收购或破产清算，将可能涉及个人信息转让，此种情况下我们会要求新的持有您个人信息的公司、组织继续受本指引的约束。如果本指引中约定的个人信息的收集、处理方式发生任何改变，该公司、组织将重新向您征求授权同意。
4.3公开披露
除非获得您的明确同意，我们不会公开披露您的个人信息。
基于法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能向有权机关披露您的个人信息。但我们保证，在上述情况发生时，我们会要求披露请求方必须出具与之相应的有效法律文件，并对被披露的信息采取符合法律和业界标准的安全防护措施。
（a）事先获得您的明确授权或同意：获得您的明确同意后，我们会与其他方共享您的个人信息；
（b）在法定情形下的共享：根据适用的法律法规、法律程序、政府的强制命令或司法裁定而需共享您的个人信息；
（c）在法律要求或允许的范围内，为了保护扣叮兔AI助手及其用户或社会公众的利益、财产或安全免遭损害而有必要提供您的个人信息给第三方；
（d）与我们的关联公司共享：您的个人信息可能会在我们的关联公司之间共享。我们只会共享必要的个人信息，且这种共享受本指引所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
（e）与授权合作伙伴共享：为了向您提供更优质、更完善的产品和服务，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验（如扣叮兔AI助手向您寄送礼品时，扣叮兔AI助手需要与物流服务提供商共享您的个人信息才能安排寄送）。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。同时，我们会与合作伙伴签署严格的保密协议，要求他们按照我们的说明、本指引以及其他任何相关的保密和安全措施来处理您的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我们的合作伙伴在提供服务时收集为提供服务所必需的个人信息，将可能导致您无法在扣叮兔AI助手中使用该第三方服务。
4.4共享、转让、公开披露个人信息授权同意的例外
根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下共享、转让、公开披露您的个人信息：
（a）与国家安全、国防安全有关的；
（b）与公共安全、公共卫生、重大公共利益有关的；
（c）与犯罪侦查、起诉、审判和判决执行直接相关的；
（d）出于维护您或其他个人的生命、财产重大合法权益但又很难得到本人同意的；
（e）您自行向社会公众公开的个人信息；
（f）从合法公开披露的信息中收集到的个人信息的，如合法的新闻报道、政府信息公开渠道；
（g）法律法规规定的其他情形。
根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法福复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
 
5. 我们如何保护您的个人信息
您的个人信息安全对于我们至关重要。我们将严格遵守相关法律法规，采取业内认可的合理可行的措施，保护您的个人信息，防止信息遭到未经授权的访问、披露、使用、修改，避免信息损坏或丢失。
  
5.1技术措施与数据安全措施
我们努力采取各种符合业界标准的物理、电子和管理方面的安全措施来保护您的个人信息安全。我们积极建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用，确保未收集与我们提供的服务无关的个人信息。
 
5.2我们仅允许有必要知晓这些信息的员工访问您的信息，并为此设置了严格的访问权限控制、权限申请机制和监控机制。我们同时要求可能接触到您的信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被终止与扣叮兔AI助手的合作关系。
 
5.3互联网并非百分之百安全，我们将尽力确保您发送给我们的任何信息的安全性。我们通过与信息接触者签署保密协议、监控和审计机制来对数据安全进行全面安全控制，防止您的个人信息遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。
 
我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止您的个人信息遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息（在您的手机与扣叮兔AI助手之间交换数据（如银行账号信息）是受加密保护的；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
根据《信息安全等级保护管理办法》的有关规定，菲助科技已经取得信息安全等级保护三级的备案证明。
5.4安全事件处置
我们将尽力确保您发送给我们的任何信息的安全性，但请您理解，由于技术的限制以及在互联网行业可能存在的各种恶意手段，不可能始终保证信息百分之百的安全。您需要了解，您接入我们服务所用的系统和通信网络，有可能因我们可控范围外的因素而出现问题。
为防止安全事故的发生，我们制定了妥善的预警机制和应急预案。若不幸发生个人信息安全事件，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议和对您的补救措施，并立即启动应急预案，力求将损失最小化。我们将及时将事件相关情况以电话、通知的方式告知您，难以逐一告知用户时，我们会采取合理、有效的方式发布公告。
同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况，紧密配合政府机关的工作。
 
 
6.我们如何使用Cookie等同类技术
Cookie 和设备信息标识等同类技术是互联网中普遍使用的技术。当您使用扣叮兔AI助手及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie 或匿名标识符，以收集、标识您访问、使用本产品时的信息。我们承诺，不会将Cookie用于本指引所述目的之外的任何其他用途。我们使用Cookie 和同类技术主要为了实现以下功能或服务：6.1保障产品与服务的安全、高效运转我们可能会设置认证与保障安全性的Cookie 或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。6.2 帮助您获得更轻松的访问体验使用此类技术可以帮助您省去重复填写个人信息、输入搜索内容的步骤和流程（示例：记录搜索、表单填写）。6.3为您推荐、展示、推送您可能感兴趣的内容或音视频
（a）我们可能会利用此类技术了解您的偏好和使用习惯，进行数据分析，以改善产品服务、推荐用户感兴趣的信息或功能，并优化您对广告的选择。
（b）在作品的分享页中，我们可能会使用Cookie对浏览活动进行记录，用于向您推荐信息和排查崩溃、延迟的相关异常情况以及探索更好的服务方式。6.4 Cookie的清除大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，您可能无法使用由我们提供的、依赖于Cookie的服务或相应功能。
 
7. 您个人信息的存储
我们将从中华人民共和国境内获得的信息存放于中华人民共和国境内。如果发生数据的跨境传输，我们会单独向您以弹窗或邮件的方式告知您数据出境的目的、接收方，并征得您的授权同意，我们会确保数据接收方有充足的数据保护能力来保护您的个人信息。
 
我们仅为实现目的所必需的最短时间保留您的个人信息：
 
《网络安全法》规定日志信息不少于6个月；
 
《电子商务法》规定交易信息在交易完成日起不少于三年；
 
《互联网信息管理办法》规定不少于60日及超期处理方式。
 
超出上述个人信息保存期限后，将对个人信息进行匿名化处理。
 
如我们因经营不善或其他原因出现停止运营的情况，我们会立即停止对您个人信息的收集，删除已收集的个人信息。我们会将此情况在App上进行公告或者以私信以及其他合理方式逐一传达到各个用户。
 
8.我们如何处理未成年人的个人信息
8.1 扣叮兔AI助手的服务覆盖未成年人和成人。若您是14周岁以下的未成年人，在使用我们的产品和/或服务前，您应在监护人的陪同下阅读本指引，并应确保已征得您监护人的同意后使用我们的产品并向我们提供您的信息。我们会根据国家相关法律法规的规定着重保护未成年人的信息。
8.2如您的监护人不同意您按照本指引使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们。
8.3对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或保护未成年人所必要的情况下使用或公开披露此信息。
8.4若您是未成年人的监护人，当您对您所监护的未成年人使用我们的服务或其向我们提供的用户信息有任何疑问时，请您及时与我们联系。我们将根据国家相关法律法规及本指引的规定保护未成年用户信息的保密性和安全性。如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会尽快删除相关数据。

 
9.如何更新与修改本指引
9.1扣叮兔AI助手保留不时更新或修改本指引的权利。
9.2未经您明确同意，我们不会削减您按照本指引应享有的权利。我们会通过App通知、弹窗等合理方式通知您，以便您能及时了解本指引所做的任何变更。
9.3对于重大变更，视具体情况我们可能还会提供更为显著的通知，说明本指引的具体变更内容。重大变更包括但不限于：
（a）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式；
（b）我们在所有权机构、组织架构方面发生重大变化。如业务调整、破产并购引起的所有者变更；
（c）个人信息共享、转让或公开披露的主要对象发生变化；
（d）您参与个人信息处理方面的权利及其行使方式发生重大变化；
（e）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；
（f）个人信息安全影响评估报告存在高风险时。
9.4若您不同意修改后的隐私保护指引，您有权并应立即停止使用扣叮兔AI助手的服务。如果您继续使用扣叮兔AI助手的服务，则视为您接受扣叮兔AI助手对本指引相关条款所做的修改。


10.争议解决
10.1因本指引以及我们处理您个人信息事宜引起的任何争议，您可诉至杭州市滨江区人民法院。
10.2如果您认为我们的个人信息处理行为损害了您的合法权益，您也可向有关政府部门进行反映。
 
11.名词解释
本指引中使用到的名词，在通常意义中有以下定义：
11.1个人信息：个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人个人身份的各种信息，包括但不限于自然人的姓名、出生日期、住址、电话号码。
11.2个人敏感信息：个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇的个人信息。个人敏感信息包括身份证号码、银行账号、通信内容、健康生理信息。
11.3设备：设备是指可用于访问扣叮兔AI助手产品的装置，如平板电脑或智能手机。
11.4唯一设备标识符：唯一设备标识符（专属ID、IMEI号或UUID）是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识设备。
11.5IP地址：每台上网设备都会指定一个编号，称为互联网协议（IP）地址。这些编号通常都是根据地理区域指定的。IP地址通常可用于识别设备连接至互联网时所在的位置。
11.6 SSL：是在传输通信协议（TCP/IP）上实现的一种安全协议。SSL支持各种类型的网络，同时提供三种基本的安全服务，均通过使用公开密钥和对称密钥技术以达到信息保密的效果。
11.7关联公司：指一方现在或将来控制、受控制或与其处于共同控制下的任何公司、机构。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被依法认定的方式。
11.8非个人身份信息：记录的与用户相关的信息，但实际上不可直接或间接识别您身份的信息，包括经过去标识化、匿名化处理或化名方式提供的个人信息。
11.9去标识化：指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。
11.10匿名化：指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。
11.11服务器日志：与大多数网站一样，我们的服务器会自动记录您在访问App时所发出的请求。这些“服务器日志”通常包括您的网络请求、互联网协议地址、浏览器类型、浏览器语言、请求的日期和时间。
      </pre>
    </div>
    <!-- <div class="mt-10 sm:mx-auto sm:w-full sm:max-w-sm">
      <button @click="goBack"
        class="mt-10 flex w-full justify-center rounded-md bg-blue px-3 py-1.5 text-sm mt-2d leading-6 text-white shadow-sm hover:bg-blue-500 focus-visible:outline focus-visible:outline-2 focus-visible:outline-offset-2 focus-visible:outline-indigo-600">
        返回
      </button>
    </div> -->
  </div>
</template>

<script lang="ts">
import terms from '@/assast/terms.json'
import { ref } from 'vue'
import './index.scss'

export default {
  name: 'TermsOfUse',
  setup() {
    const goBack = () => {
      history.back();
    }
    return {
      title: '《隐私保护指引》',
      goBack
    }
  }
}
</script>